Repository: MOSSTAAFA/data-run-mobile
Catalog: lib/l10n/intl_*.arb
Languages: ar

# networkTimeout
source: Request timed out. Please try again.
ar: انتهت مهلة الطلب. يرجى المحاولة مرة أخرى.

# networkConnectionFailed
source: Connection failed. Check your network.
ar: فشل في الاتصال بالشبكة. يرجى التحقق من الاتصال والمحاولة مرة أخرى.

# authInvalidCredentials
source: Invalid login credentials provided.
ar: بيانات الدخول التي تم إدخالها غير صحيحة. يرجى التحقق والمحاولة مرة أخرى.

# authSessionExpired
source: Your session has expired. Please log in again.
ar: انتهت صلاحية الجلسة. يرجى تسجيل الدخول للمتابعة.

# noAuthenticatedUser
source: Credentials do not match authenticated user. Cannot login offline.
ar: بيانات الاعتماد المقدمة لا تطابق مستخدمًا سبق وأن سجل. لا يمكن تسجيل الدخول في وضع عدم الاتصال بالإنترنت.

# noAuthenticatedUserOffline
source: The user hasn't been previously authenticated. Cannot login offline.
ar: لم يتم توثيق المستخدم مسبقاً. لا يمكن تسجيل الدخول في وضع عدم الاتصال.

# differentOfflineUser
source: Different authenticated user offline
ar: جلسة عدم الاتصال الحالية موثقة لمستخدم مختلف.

# accountDisabled
source: This account is disabled. contact Administrator for details.
ar: تم تعطيل هذا الحساب. يرجى الاتصال بالمسؤول للمساعدة.

# databaseConnectionFailed
source: Failed to connect to the database.
ar: فشل في الاتصال بقاعدة البيانات. يرجى المحاولة مرة أخرى أو الاتصال بالدعم.

# databaseQueryFailed
source: Error occurred while querying the database.
ar: حدث خطأ أثناء معالجة طلب قاعدة البيانات. يرجى المحاولة مرة أخرى.

# databaseInternalError
source: Database returned an Error ${error}.
ar: واجهت قاعدة البيانات خطأ: ${error}.

# syncError
source: Error While Trying to Sync data ${error}.
ar: حدث خطأ أثناء مزامنة البيانات: ${error}. يرجى المحاولة مرة أخرى.

# unknownError
source: Error: ${error}.
ar: حدث خطأ غير متوقع: ${error}. يرجى المحاولة مرة أخرى.

# validationError
source: Please correct the errors in the form.
ar: يرجى تصحيح الأخطاء في النموذج قبل المتابعة.

# apiError
source: An error occurred while interacting with the API ${error}.
ar: حدث خطأ أثناء التواصل API النظام: ${error}.

source: Show Password
ar: أظهر كلمة السر

source: Hide Password
ar: اخفاء كلمة السر

source: Login
ar: تسجيل الدخول

source: Syncing Configuration
ar: إعدادات المزامنة

source: Configuration Ready
ar: اكتملت تهيئة التطبيق

source: Syncing Data
ar: مزامنة بيانات

source: Syncing Events
ar: مزامنة الإستمارات

source: password
ar: كلمة المرور

source: user
ar: مستخدم

source: Username
ar: اسم المستخدم

source: View List
ar: عرض القائمة

source: Add New
ar: إضافة جديد

# form
source: {count, plural, =0{no forms available} =1{1 form available} =2{2 forms available} other{{count} forms available}}
ar: {count, plural, =0{لا تتوفر استمارات لهذا النشاط} =1{تتوفر 1 استمارة} =2{تتوفر استمارتان} other{{count} استمارة متوفرة}}

# viewAvailableForms
source: Expand to View Available Forms
ar: افتح لاستعرض الاستمارات المتاحة

source: Dashboard
ar: الرئيسية

source: Enter Your Username
ar: من فضلك أدخل اسم المستخدم

source: Sync Form Data
ar: مزامنة بيانات الاستمارة

# confirmSyncFormData
source: Are you sure you want to sync the selected entities?
ar: هل أنت متأكد أنك تريد مزامنة البيانات المحددة؟

source: Error
ar: خطأ

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: OK
ar: موافق

source: Final Data
ar: بيانات نهائية

source: Discard
ar: تجاهل

source: Open
ar: فتح

source: Open New Form
ar: فتح استمارة جديدة

source: Error Opening New Form
ar: حدث خطأ أثناء فتح الإستمارة

# markAsFinalData
source: Make the form Final before exiting.
ar: حقول مكتملة، هل تبريد تعيين هذه البيانات كنهائية وجاهزة للإرسال؟

source: Not Now
ar: ليس الآن

source: Send
ar: إرسال

source: NMCP Yemen
ar: البرنامج الوطني لمكافحة الملاريا

source: objectAccessDenied
ar: الوصول مرفوض لهذا الكائن

source: objectAccessClosed
ar: الوصول مغلق لهذا الكائن

source: No forms available
ar: لا تتوفر استمارات لهذا النشاط

source: Months
ar: أشهر

source: Years
ar: سنوات

source: And
ar: و

# year
source: {count, plural, =0{ } =1{1 Year} =2{2 Years} few{{count} Years} other{{count} Years}}
ar: {count, plural, =0{} =1{سنة} =2{سنتان} few{{count} سنوات} other{{count} سنة}}

# month
source: {count, plural, =0{ } =1{1 Month} =2{2 Months} few{{count} Years} other{{count} Months}}
ar: {count, plural, =0{ } =1{شهر} =2{شهران} few{{count} أشهر} other{{count} شهر}}

source: Version
ar: الإصدار

source: Clear
ar: تصفية

source: Accept
ar: قبول

source: Level
ar: المستوى

# orgUnitHelpText
source: Select Org Unit
ar: اختر اسم المكان

# orgUnitInputLabel
source: Select Org Unit
ar: اختر اسم المكان

# orgUnitDialogTitle
source: Search for and Select OrgUnit
ar: ابحث عن المكان

# searchOrgUnitsHelpText
source: Search Org Units...
ar: البحث عن مكان...

# submissionInitialData
source: Main
ar: الرئيسة

# submissionDataEntry
source: Data
ar: بيانات

source: Notifications
ar: تنبيهات

source: Full Name
ar: الاسم الكامل

source: First Name
ar: الاسم الأول

source: Middle Name
ar: الاسم الأوسط

source: Last Name
ar: اللقب

source: Home
ar: الرئيسة

source: Item Removed
ar: تم الحذف

# conformDeleteMsg
source: Are you sure you want to remove this section?
ar: هل أنت متأكد أنك تريد إزالة هذا القسم؟

source: Undo
ar: تراجع

source: selected
ar: عناصر محددة

source: This field is required.
ar: هذا الحقل مطلوب.

# pleaseEnterAValidEmailAddress
source: enter a valid email address.
ar: يرجى إدخال عنوان بريد إلكتروني صالح.

# enterAValidNumber
source: Please enter a valid number.
ar: يرجى إدخال رقم صالح.

# valueMustBeLessThanOrEqualToError
source: The value must be less than or equal to ${error}.
ar: يجب أن تكون القيمة أقل من أو تساوي ${error}.

# maximumAllowedLengthIsError
source: The maximum allowed length is ${error}.
ar: الحد الأقصى للطول المسموح به هو ${error}.

source: Logout
ar: تسجيل الخروج

source: Settings
ar: إعدادات

# fetchUpdates
source: Fetch From Server
ar: تحديث

source: Appearance
ar: المظهر

source: User Settings
ar: إعدادات المستخدم

source: Toggle Brightness
ar: تبديل الإضاءة

source: Select Color Theme
ar: ثيم الألوان

source: Select Image for Color Extraction
ar: حدد صورة لاستخلاص ثيم منها

source: Select a seed color
ar: حدد لون الأساس

source: Select a color extraction image
ar: حدد صورة لإستخلاص الألوان

source: Organization
ar: الوحدة التنظيمية

source: Change Password
ar: تغيير كلمة السر

source: Language
ar: اللغة

# logoutNote
source: your data will not be deleted when you login back again
ar: تسجيل خروج المستخدم الحالي

source: Form contains some errors
ar: يوجد أخطاء في بعض الحقول

source: Dismiss
ar: حسنًا

# fieldsWithErrorInfo
source: Fields with Error
ar: قم بالرجوع ومراجعة الإخطاء أو (ليس الآن) للحفظ والمراجعة في وقت لاحق! لن يتسنى لك تعيين الاستمارة كنهائية وإرسالها إلا بعد تصحيح الأخطاء:

# reviewFormData
source: Review Form
ar: مراجعة الأخطاء

# valueMustBeGreaterThanOrEqualToError
source: The value must be greater than or equal to ${error}.
ar: يجب أن تكون القيمة أكبر من أو تساوي ${error}.

source: Current username
ar: المستخدم الحالي

source: Check Fields later
ar: ليس الآن

# makeFormFinalOrSaveBody
source: Make Form Final for Send to server, or save as draft!
ar: قم بتعيين الاستمار كنهائية حتى يتسنى لك إرسالها، أو اختر (ليس الآن) لحفظها كمسودة إلى وقت لاحق!

# deleteConfirmationMessage
source: Are you sure you want to delete this item?
ar: هل تريد بالتأكيد حذف هذا العنصر؟

source: Form Summary View
ar: عرض خلاصة الاستمارة

source: Edit
ar: تعديل

source: No internet access
ar: غير متصل

source: online!
ar: متصل

source: Empty
ar: فارغ

source: Save and Check
ar: حفظ وتحقق

source: Save
ar: حفظ

source: Delete
ar: حذف

source: field Contain Errors
ar: يحوي أخطاء

source: Starting sync...
ar: بدء التحديث

source: Server URL
ar: رابط السيرفر
